import numpy as np
import sympy as sp
# Умножение матрицы на скаляр
# _________________________________________________________________________
A = np.array([[1, -2], [3, 4]])
print(A)

# Скаляр
k = 3


B = A * k
print(B)
# _________________________________________________________________________
# Найти Обратную матрицу
# _________________________________________________________________________

A2 = sp.Matrix([[4,-2,1],[1,6,-2],[1,0,0]])
# Найти детерминант
detA2 = A2.det()
print(f'Determinant: ', detA2)
# матрица алгебраических дополнений
C = A2.cofactor_matrix()
print(C)
# Транспонируем матрицу
CT = C.T
print(CT)
# Обратная матрица найдена CTA
CTA = -0.5 * CT
print(CTA)
# Проверка по формуле должна получиться матрица с 1 по диагонале = E
check_matrix = CTA * A2
print(f'Проверка матрицы А^-1 * A: ', check_matrix)
# _________________________________________________________________________
