import numpy as np
import sympy as sp
import matplotlib.pyplot as plt

# Операции с векторами

# Умножение и деление
# _________________________________________________________________________
a = np.array([1, 2, 3])
b = np.array([4, 5, 6])

a_u = a + b
a_v = a - b
print(a_u)
print(a_v)

# _________________________________________________________________________
# Умножение вектора на скаляр
k = 2
a_k = a * k
print(f'Умножение вектора на скаляр',a_k)

# _________________________________________________________________________
# Скалярное произведение - два вектора одинаковой длины
SK = np.dot(a, b)
# Либо
SK_2 = a @ b
print(f"Скалярное произведение", SK)
print(SK_2)

# _________________________________________________________________________
# Длина норма вектора
DL = np.linalg.norm(a)
DL_2 = np.linalg.norm(b)
print(DL)
print(DL_2)

# _________________________________________________________________________
# Угол между векторами (через cos)

cos = (a @ b) / (np.linalg.norm(a) * np.linalg.norm(b))
print(f'Угол между векторами через cos', cos)

# _________________________________________________________________________
# Векторное произведение (cross product) — только для 3D
a2 = np.array([1,2,3])
b2 = np.array([4,5,6])

VP = np.cross(a2,b2)
print(f'Векторное произведение', VP)

# _________________________________________________________________________
# Поэлементное умножение (Hadamard) — НЕ матричное
UM = a * b
print(f'Поэлементное умножение', UM)

# _________________________________________________________________________
# Умножение матрицы на вектор (главное в линейной алгебре) ответом является двумерный вектор

a3 = np.array([[1,2,3],
              [4,5,6]])
x = np.array([10,20,30])

b = a3 @ x
print(b)

# _________________________________________________________________________
# Умножение вектора на матрицу (слева)

y = np.array([1, 2])  # как строка
a_4 = np.array([[1,2,3],
              [4,5,6]])
LF = y @ a_4
print(f'Умножение вектора на матрицу (слева) ', LF)
