import numpy as np
import sympy as sp
# Решение линейных уравнений.
# Методом Подстановки, Гаусса, Крамера, с помощью обратной матрицы


# _________________________________________________________________________
# Найти определитель матрицы например для решения линейного уравнения
A = np.array([[1, 1, 2],
              [1, -1, 2],
              [2, -1, -1]], dtype=float)

det = np.linalg.det(A)
print(int(det))

# _________________________________________________________________________
# Транспонирование матрицы
Z = np.array([[1, 1, 2],
              [1, -1, 2],
              [2, -1, -1]], dtype=float)
ZT = Z.T
print(ZT)
# _________________________________________________________________________
# Решение уравнений с помощью обратной матрицы

A = np.array([[1, 1, 2],
              [1, -1, 2],
              [2, -1, -1]], dtype=float)

B = np.array([6, 5, 3], dtype=float)
x = np.linalg.inv(A) @ B
print(x)
# [2.5 0.5 1.5]
# _________________________________________________________________________

# Пошаговое выполнение
A = sp.Matrix([[1, 1, 2],
               [1, -1, 2],
               [2, -1, -1]])

detA = A.det()          # 10
adjA = A.adjugate()     # присоединенная
A_inv = adjA / detA     # обратная

print("det =", detA)
print("adj(A) ="); print(adjA)
print("A^-1 ="); print(A_inv)
