bag = ['шлем', 'свитер', 'шайба', 'пластырь', 'бутерброд', 'телефон', 'коньки']

result_1 = 'бутерброд' in bag  # Есть ли значение 'бутерброд' в списке bag?
# Печатаем:
print('Есть ли бутерброд?',result_1)

result_2 = 'глобус' in bag  # Есть ли значение 'глобус' в списке bag?
# Печатаем:
print('Есть ли глобус?', result_2)

months = ['Январь', 'Февраль', 'Март', 'Апрель', 'Май', 'Июнь', 'Июль', 'Август', 'Сентябрь', 'Октябрь', 'Ноябрь', 'Декабрь']

# Проверка на наличие значения 'Мартобрь' в списке:
print('Есть ли Мартобрь в списке? Ответ:','Мартобрь' in months)